<details><summary>plan for dev-vpc 2024-06-24 14:17:26 (UTC)</summary>
        <details><summary>Locking successful</summary>
  Project diggerhq/demo-ee-features#dev-vpc has been locked by PR #12
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.foo will be updated in-place
  ~ resource "aws_ssm_parameter" "foo" {
        id              = "/dev/vpc"
      + insecure_value  = (known after apply)
        name            = "/dev/vpc"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 2 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # null_resource.test will be created
  + resource "null_resource" "test" {
      + id = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details><summary>Terraform plan validation check (dev-vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


Terraform plan summary
| CHANGE |        RESOURCE         |
|--------|-------------------------|
| add    | `null_resource.test`    |
| update | `aws_ssm_parameter.foo` |


</details>